var province = ["北京市","天津市","上海市","重庆市","河北省","山西省",
                "内蒙古","辽宁省","吉林省","黑龙江省","江苏省","浙江省",
                "安徽省","福建省","江西省","山东省","河南省","湖北省",
                "湖南省","广东省","广西","海南省","四川省","贵州省",
                "云南省","西藏","陕西省","甘肃省","青海省","宁夏","新疆"]


var city = {
  北京市: ["北京市"],
  上海市: ["上海市"],
  天津市: ["天津市"],
  重庆市: ["重庆市"],
  江苏省: ["南京市","徐州市","连云港市","宿迁市","淮安市","盐城市","扬州市","泰州市","南通市","镇江市","常州市","无锡市","苏州市"],

}

var district = {
  北京市: ["东城区","西城区","崇文区","宣武区","朝阳区","丰台区",
          "海淀区","石景山区","门头沟区","房山区","通州区","顺义区",
          "昌平区","大兴区","怀柔区","平谷区","密云县","延庆县"],

  上海市: ["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区",
          "闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区",
          "浦东新区","金山区","松江区","青浦区","南汇区","奉贤区","崇明县","城桥镇"],

  天津市: ["和平区","河东区","河西区","南开区","河北区","红桥区",
          "塘沽区","汉沽区","大港区","东丽区","西青区","津南区",
          "北辰区","武清区","宝坻区","蓟县","宁河县","芦台镇","静海县","静海镇"],

  重庆市: ["渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区",
          "北碚区","万盛区","双桥区","渝北区","巴南区","万州区","涪陵区",
          "黔江区","长寿区","合川市","永川区市","江津市","南川市","綦江县",
          "潼南县","铜梁县","大足县","荣昌县","璧山县","垫江县","武隆县",
          "丰都县","城口县","梁平县","开县","巫溪县","巫山县","奉节县","云阳县",
          "忠县","石柱土家族自治县","彭水苗族土家族自治县","酉阳土家族苗族自治县","秀山土家族苗族自治县"],

  南京市: ["玄武区","白下区","秦淮区","建邺区","鼓楼区","下关区","浦口区","六合区",
          "栖霞区","雨花台区","江宁区","溧水县","永阳镇","高淳县","淳溪镇"],

  徐州市: ["云龙区","鼓楼区","九里区","贾汪区","泉山区","邳州市","新沂市","铜山县",
          "铜山镇","睢宁县","睢城镇","沛县","沛城镇","丰县","凤城镇"],
}